---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarHookType
source: html/a039ce3c-2ce9-7062-fb50-e4bbf9dc45f1.htm
---
# RebarHookType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.